#=========================================================================================

# n = [0] * 3 

# for i in range (3):
#     n[i] = int(input("Vedite chislo "))

# print((n[0] ** 2)+(n[1] ** 2)+(n[2] ** 2))

#=========================================================================================
#=========================================================================================

# word = input("Vedite slovo ")

# if word == 0:
#     print("False")
# else:
#     print("True")

#=========================================================================================
#=========================================================================================

# Оператор среза (:) — это синтаксическая конструкция языка Python, используемая внутри индексирования для получения подпоследовательности элементов из последовательного объекта (строки, списка и т.д.).

# Срез работает по принципу диапазона:
# он возвращает новый объект, содержащий элементы, начиная с указанной начальной позиции и заканчивая позицией перед конечной границей (конечный индекс не включается).

# Если одна из границ не указана, используется начало или конец последовательности соответственно.

# Срез не изменяет исходный объект, а создаёт его новую часть.


# def cut(word):
#     print(word[1:-1])


# word = input("Vedite slovo ")
# cut(word)

#=========================================================================================
#=========================================================================================
    
# def maximum(arr):
#     sum = 0
#     for i in range(10):
#         if arr[i] > sum:
#             sum = arr[i]
#     print("Max = ", sum)

# def minimum(arr):
#     sum = 0
#     for i in range(10):
#         if arr[i] < sum:
#             sum = arr[i]
#     print("Min = ", sum)
    

# arr = [0] * 10

# for i in range(10):
#     arr[i] = int(input("Vedite chislo "))

# maximum(arr)
# minimum(arr)

#=========================================================================================
#=========================================================================================
